Revit 2027 API
FamilyItemFactory.NewLinearDimension Method
 Creates a new linear dimension object.
Overload List
Name | Description
NewLinearDimension(View, Line, ReferenceArray) |  Generate a new linear dimension object using the default dimension type.
NewLinearDimension(View, Line, ReferenceArray, DimensionType) |  Creates a new linear dimension object using the specified dimension type.
Top
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace